import CodingIcon from "@/assets/icons/coding.svg";
import GraduationIcon from "@/assets/icons/graduation.svg";
import KnowledgeIcon from "@/assets/icons/knowledge.svg";
import SupportIcon from "@/assets/icons/support.svg";

export const ADVANTAGES = [
  {
    key: "name 1",
    icon: CodingIcon,
    title: "Готов обучаться самостоятельно",
    description:
      "Наши программы позволяют учащимся изучать материалы в собственном темпе, что идеально " +
      "подходит для тех, кто предпочитает самостоятельное обучение. Мы предоставляем все необходимые " +
      "ресурсы и поддержку, чтобы ученик мог развивать свои навыки и знания эффективно и уверенно.",
  },
  {
    key: "name 2",
    icon: GraduationIcon,
    title: "Не может сконцентрировать свое внимание при обучении в группе",
    description:
      "Индивидуальный подход к обучению помогает сосредоточиться на материале без отвлекающих факторов. " +
      "Наши методики ориентированы на поддержание высокой степени вовлеченности, что способствует лучшему " +
      "усвоению информации и повышению концентрации.",
  },
  {
    key: "name 3",
    icon: KnowledgeIcon,
    title: "Не успевает за школьной программой",
    description:
      "Мы предлагаем адаптированные программы, которые позволяют наверстать упущенное и достичь академических " +
      "целей. Наши преподаватели разрабатывают индивидуальные планы занятий, чтобы каждый ученик мог идти в своем " +
      "темпе и успешно осваивать школьную программу.",
  },
  {
    key: "name 4",
    icon: SupportIcon,
    title: "Заучивает школьную программу, но ничего не понимает",
    description:
      "Мы делаем акцент на глубокое понимание материала, а не на механическое запоминание. Наша цель — помочь " +
      "ученикам осознать и применять знания на практике, что значительно повышает их академическую успеваемость и " +
      "интерес к учебе.",
  },
];
